{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_7", "output_dim": 100, "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dtype": "float32", "input_dim": 5760, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "batch_input_shape": [null, 5760]}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_5", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "dropout_5"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_8", "output_dim": 100, "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dtype": "float32", "input_dim": 100, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "batch_input_shape": [null, 5760]}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_6", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_9", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 100, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_9"}}]}