{"class_name": "Model", "keras_version": "1.2.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 5760], "input_dtype": "float32", "sparse": false, "name": "input_4"}, "inbound_nodes": [], "name": "input_4"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_83", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dim": 5760, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "output_dim": 100}, "inbound_nodes": [[["input_4", 0, 0]]], "name": "dense_83"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_117", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dim": 100, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "output_dim": 100}, "inbound_nodes": [[["dense_83", 0, 0]]], "name": "dense_117"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_149", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["dense_117", 0, 0]]], "name": "batchnormalization_149"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_77"}, "inbound_nodes": [[["batchnormalization_149", 0, 0]]], "name": "activation_77"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_118", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dim": 100, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "output_dim": 100}, "inbound_nodes": [[["activation_77", 0, 0]]], "name": "dense_118"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_150", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["dense_118", 0, 0]]], "name": "batchnormalization_150"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_151", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["batchnormalization_150", 0, 0]]], "name": "batchnormalization_151"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_78"}, "inbound_nodes": [[["batchnormalization_151", 0, 0]]], "name": "activation_78"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_119", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dim": 100, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "output_dim": 100}, "inbound_nodes": [[["activation_78", 0, 0]]], "name": "dense_119"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_152", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["dense_119", 0, 0]]], "name": "batchnormalization_152"}, {"class_name": "Merge", "config": {"name": "merge_36", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["dense_117", 0, 0], ["batchnormalization_152", 0, 0]]], "name": "merge_36"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_153", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_36", 0, 0]]], "name": "batchnormalization_153"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_79"}, "inbound_nodes": [[["batchnormalization_153", 0, 0]]], "name": "activation_79"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_120", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 100, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 100}, "inbound_nodes": [[["activation_79", 0, 0]]], "name": "dense_120"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_154", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0]]], "name": "batchnormalization_154"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_80"}, "inbound_nodes": [[["batchnormalization_154", 0, 0]]], "name": "activation_80"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_121", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 100, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}, "inbound_nodes": [[["activation_80", 0, 0]]], "name": "dense_121"}], "input_layers": [["input_4", 0, 0]], "output_layers": [["dense_121", 0, 0]], "name": "model_1"}}