{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_7", "border_mode": "same", "activity_regularizer": null, "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 100, "input_dtype": "float32", "b_learning_rate_multiplier": null, "batch_input_shape": [null, 1, 9, 2], "W_regularizer": null, "activation": "linear", "nb_row": 9}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_15"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_5"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_13", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1800, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 100}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_16"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_14", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 100, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 100}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_13"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_17"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_15", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 100, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_14"}}]}